// JavaScript динамически тепатезированный язык

//Тип данных object
переменная имя переменной = {
    //Свойство объекта
    ключ: значение
    ключ: значение
}


//

Math // Объект Math является встроенным объектом, хранящим в своих свойствах и методах различные математические константы и функции. Объект Math не является функциональным объектом


/* 
Для вызова свойства объекта необходимо поставить после объекта точку и обозначить, его свойство, пример :   (Math.PI) 

*/

// Виртуозное владение горячими клавишами - 
/* 
CTRL + SHIFT + P = Удаление строки
CTRL + SHIFT = Меняет строки местами
CTRL + M  

Дополнителные = 

F2 — переименовать символ (функцию, переменную и т.д.);
Ctrl + Shift + O — перейти к символу;
Ctrl + K Z — перейти в режим Дзен, в котором вас не отвлекают лишние детали;
Ctrl + / — закомментировать/раскомментировать строку;
Shift + Alt + A — закоммент область;
Ctrl + Shift + ] — развернуть область;
Ctrl + H — заменить;ировать/раскомментировать блок кода;
Ctrl + Shift + [ — свернуть
Shift + F12 — показать все упоминания;
F12 — открыть определение (функции, класса и т.д.);
Ctrl + K F12 — открыть определение в другой части экрана;
Ctrl + K M — изменить язык файла;
Ctrl + P — быстро открыть файл;
Ctrl + \ — разделить экран;
Ctrl + ` — открыть встроенный терминал;
Ctrl + K Ctrl + S — показать список всех горячих клавиш.

--------------------------------------------------------------------
Вот некоторые комбинации горячих клавиш:
 CTRL+C: копирование
 CTRL+X: вырезание
 CTRL+V: вставка
 CTRL+Z: отмена действия
 DELETE: удаление
 SHIFT+DELETE: удаление выбранного объекта без возможности восстановления, не помещая объект в корзину
 CTRL с перетаскиванием объекта: копирование выделенного объекта
 CTRL+SHIFT с перетаскиванием объекта: создание ярлыка для выбранного объекта
 Клавиша F2: переименование выбранного объекта
 CTRL+СТРЕЛКА ВПРАВО: перемещение точки ввода в начало следующего слова
 CTRL+СТРЕЛКА ВЛЕВО: перемещение точки ввода в начало предыдущего слова
 CTRL+СТРЕЛКА ВНИЗ: перемещение точки ввода в начало следующего абзаца
 CTRL+СТРЕЛКА ВВЕРХ: перемещение точки ввода в начало предыдущего абзаца
 CTRL+SHIFT + клавиши со стрелками: выделение блока текста
 SHIFT + клавиши со стрелками: выбор нескольких объектов в окне или на рабочем столе, а также выделение текста в документе
 CTRL+A: выделение всего документа
 Клавиша F3: поиск файла или папки
 ALT+ВВОД: просмотр свойств выбранного объекта
 ALT+F4: закрытие активного окна или завершение работы активной программы
 ALT+ВВОД: просмотр свойств выбранного объекта
 ALT+ПРОБЕЛ: вызов контекстного меню активного окна
 CTRL+F4: закрытие активного документа в приложениях, в которых одновременно можно открыть несколько документов
 ALT+ТАБУЛЯЦИЯ: переход между открытыми объектами
 ALT+ESC: просмотр объектов в том порядке, в котором они были открыты
 Клавиша F6: поочередный просмотр элементов интерфейса в окне или на рабочем столе
 Клавиша F4: отображение панели адресов в папке «Мой компьютер» или в обозревателе

*/