// JavaScript динамически тепатезированный язык

//Тип данных object
переменная имя переменной = {
    //Свойство объекта
    ключ: значение
    ключ: значение
}


//

Math // Объект Math является встроенным объектом, хранящим в своих свойствах и методах различные математические константы и функции. Объект Math не является функциональным объектом


/* 
Для вызова свойства объекта необходимо поставить после объекта точку и обозначить, его свойство, пример :   (Math.PI) 

*/

// Виртуозное владение горячими клавишами - 
/* 
CTRL + SHIFT + P = Удаление строки
CTRL + SHIFT = Меняет строки местами
CTRL + M  

Дополнителные = 

F2 — переименовать символ (функцию, переменную и т.д.);
Ctrl + Shift + O — перейти к символу;
Ctrl + K Z — перейти в режим Дзен, в котором вас не отвлекают лишние детали;
Ctrl + / — закомментировать/раскомментировать строку;
Shift + Alt + A — закомментировать/раскомментировать блок кода;
Ctrl + Shift + [ — свернуть область;
Ctrl + Shift + ] — развернуть область;
Ctrl + H — заменить;
Shift + F12 — показать все упоминания;
F12 — открыть определение (функции, класса и т.д.);
Ctrl + K F12 — открыть определение в другой части экрана;
Ctrl + K M — изменить язык файла;
Ctrl + P — быстро открыть файл;
Ctrl + \ — разделить экран;
Ctrl + ` — открыть встроенный терминал;
Ctrl + K Ctrl + S — показать список всех горячих клавиш.


*/