    // В javascript есть 8 типов данных  || Урок 4
    var number = 5;
    var string = "Hello!";
    var sym = Symbol();
    var boolean = true; 
    null; // это отсутствие объекта в коде. Сыллка на несуществующую вещь.
    undefined; // это ссылка на объект который существует но он без заданых значений.
    var obj = {};

    // к объкта также относиться 
    function name(params) {}
    Array
    //Ошибки

console.log(4 / 0);
//result: Infinity

//----------------------------------------------------------------------------------------------

//Интерактив с пользователем || 5 Урок

// Команды для пользователя.
confirm(); // Вопрос
prompt(); // Поле вода 



//--------------------------------------------------------------------------------------------|| Урок 6 (Операторы)

// && (Или) true если все значения true 
// || (и) true есть хоть одно значение true




